Service - Income Tax/sample messages/file_request_ir7l_standalone.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <add:Action xmlns:add="http://www.w3.org/2005/08/addressing">https://services.ird.govt.nz/GWS/Returns/Return/File</add:Action>
    </soap:Header>
    <soap:Body>
        <ret:File xmlns:ret="https://services.ird.govt.nz/GWS/Returns/">
            <ret:ReturnFileRequestMsg>
                <fil:FileRequestWrapper xmlns:fil="https://services.ird.govt.nz/GWS/Returns/:types/FileRequest">
                    <r7:fileRequest xmlns:r7="urn:www.ird.govt.nz/GWS:types/ReturnIR7.v1" xmlns:rc="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v2">
                        <rc:fileHeader xmlns:cmn="urn:www.ird.govt.nz/GWS:types/Common.v2">
                            <cmn:softwareProviderData>
                                <cmn:softwareProvider>SoftwareProvider</cmn:softwareProvider>
                                <cmn:softwarePlatform>SoftwarePlatform</cmn:softwarePlatform>
                                <cmn:softwareRelease>1</cmn:softwareRelease>
                            </cmn:softwareProviderData>
                            <cmn:identifier IdentifierValueType="IRD">105493711</cmn:identifier>
                            <cmn:accountType>INC</cmn:accountType>
                            <rc:periodEndDate>2023-03-31</rc:periodEndDate>
                            <rc:majorFormType>INC</rc:majorFormType>
                            <rc:minorFormType>7</rc:minorFormType>
                        </rc:fileHeader>
                        <rc:fileBody>
                            <rc:standardFields>
                                <rc:isNilReturn>false</rc:isNilReturn>
                                <rc:isFinalReturn>false</rc:isFinalReturn>
                                <rc:amendmentRequest>
                                    <rc:isAmended>false</rc:isAmended>
                                    <rc:amendReason/>
                                    <rc:amendDetails/>
                                </rc:amendmentRequest>
                            </rc:standardFields>
                            <rc:formFields xsi:type="r7:FormFieldsType" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ic="urn:www.ird.govt.nz/GWS:types/IncomeReturnCommon.v1">
                                <r7:schedularPayments>
                                    <ic:withholdingTaxDeducted>200.00</ic:withholdingTaxDeducted>
                                    <ic:totalIncome>1000.00</ic:totalIncome>
                                </r7:schedularPayments>
                                <r7:interestIncome>
                                    <ic:totalTaxPaid>50</ic:totalTaxPaid>
                                    <ic:totalIncome>-2000</ic:totalIncome>
                                </r7:interestIncome>
                                <r7:dividendIncome>
                                    <ic:totalImputationCredits>45</ic:totalImputationCredits>
                                    <ic:totalRWTCredits>40.00</ic:totalRWTCredits>
                                    <ic:totalGrossDividends>300.00</ic:totalGrossDividends>
                                </r7:dividendIncome>
                                <r7:maoriAuthorityDistributions>
                                    <ic:totalMACredits>35.00</ic:totalMACredits>
                                    <ic:totalMADistributions>400.00</ic:totalMADistributions>
                                </r7:maoriAuthorityDistributions>
                                <r7:partnershipIncome>
                                    <ic:totalTaxCredits>30.00</ic:totalTaxCredits>
                                    <ic:totalIncome>500.00</ic:totalIncome>
                                </r7:partnershipIncome>
                                <r7:ltcIncome>
                                    <ic:totalTaxCredits>25</ic:totalTaxCredits>
                                    <ic:totalIncome>600</ic:totalIncome>
                                </r7:ltcIncome>
                                <r7:ltcNonAllowableDeductions>0</r7:ltcNonAllowableDeductions>
                                <r7:ltcPriorYearNonAllowableDeductionsClaimed>0</r7:ltcPriorYearNonAllowableDeductionsClaimed>
                                <r7:ltcAdjustedIncome>600</r7:ltcAdjustedIncome>
                                <r7:overseasIncome>
                                    <ic:totalTaxPaid>20.00</ic:totalTaxPaid>
                                    <ic:totalIncome>700.00</ic:totalIncome>
                                </r7:overseasIncome>
                                <r7:residentialRentalIncome>
                                    <ic:indicator>I</ic:indicator>
                                    <ic:grossResRentalIncome>700.00</ic:grossResRentalIncome>
                                    <ic:netBrightlineProfits>700.00</ic:netBrightlineProfits>
                                    <ic:otherResIncome>700.00</ic:otherResIncome>
                                    <ic:totalIncome>2100.00</ic:totalIncome>
                                    <ic:residentialRentalDeductions>1000.00</ic:residentialRentalDeductions>
                                </r7:residentialRentalIncome>
                                <r7:propertyInterestLimitation>
                                    <ic:totalInterest>1000.00</ic:totalInterest>
                                    <ic:interestExpenseClaimed>1000.00</ic:interestExpenseClaimed>
                                    <ic:interestExpenseClaimedReason>
                                        <ic:notResidentialOrMaoriExempt>false</ic:notResidentialOrMaoriExempt>
                                        <ic:propertyNotInNz>false</ic:propertyNotInNz>
                                        <ic:loansDrawnDown>false</ic:loansDrawnDown>
                                        <ic:newBuildExemption>false</ic:newBuildExemption>
                                        <ic:developmentExemption>false</ic:developmentExemption>
                                        <ic:emergencyTransitionalSocialCouncil>false</ic:emergencyTransitionalSocialCouncil>
                                        <ic:buildToRentExclusion>true</ic:buildToRentExclusion>
                                    </ic:interestExpenseClaimedReason>
                                </r7:propertyInterestLimitation>
                                <r7:pieIncome>
                                    <ic:totalTaxCredits>15</ic:totalTaxCredits>
                                    <ic:totalIncome>800</ic:totalIncome>
                                </r7:pieIncome>
                                <r7:businessIncome>900.00</r7:businessIncome>
                                <r7:netRentalIncome>1000.00</r7:netRentalIncome>
                                <r7:otherIncome>0.00</r7:otherIncome>
                                <r7:rlwtCredit>0</r7:rlwtCredit>
                                <r7:saleOfProperty>0.00</r7:saleOfProperty>
                                <r7:totalIncome>6400</r7:totalIncome>
                                <r7:totalExpenses>0.00</r7:totalExpenses>
                                <r7:totalIncomeLossAfterExpenses>6400</r7:totalIncomeLossAfterExpenses>
                                <r7:extinguishedLosses>0.00</r7:extinguishedLosses>
                                <r7:priorYearsDeductions>0.00</r7:priorYearsDeductions>
                                <r7:deductionsClaimedThisYear>0.00</r7:deductionsClaimedThisYear>
                                <r7:lookThrough>true</r7:lookThrough>
                                <r7:partnership>false</r7:partnership>
                                <r7:cfcFIFdisclosure>false</r7:cfcFIFdisclosure>
                                <r7:incomeAttributionDetails>
                                    <ic:incomeAttribution>
                                        <ic:irdNumber>045161595</ic:irdNumber>
                                        <ic:shareOfInterestIncome>6400</ic:shareOfInterestIncome>
                                        <ic:shareOfDividendIncome>0.00</ic:shareOfDividendIncome>
                                        <ic:shareOfMADistributions>0.00</ic:shareOfMADistributions>
                                        <ic:shareOfOverseasIncome>0.00</ic:shareOfOverseasIncome>
                                        <ic:shareOfResidentialRentalIncome>0.00</ic:shareOfResidentialRentalIncome>
                                        <ic:shareOfRentalIncome>0.00</ic:shareOfRentalIncome>
                                        <ic:shareOfPassiveIncome>0.00</ic:shareOfPassiveIncome>
                                        <ic:shareOfOtherIncome>0.00</ic:shareOfOtherIncome>
                                        <ic:totalIncome>6400</ic:totalIncome>
                                        <ic:deductionForExtinguishedLoss>0.00</ic:deductionForExtinguishedLoss>
                                        <ic:shareOfResidentialRentalDeductions>0.00</ic:shareOfResidentialRentalDeductions>
                                        <ic:shareOfOverseasTaxPaid>20</ic:shareOfOverseasTaxPaid>
                                        <ic:shareOfImputationCredits>45</ic:shareOfImputationCredits>
                                        <ic:shareOfOtherTaxCredits>395</ic:shareOfOtherTaxCredits>
                                        <ic:attributionOfIncome>100</ic:attributionOfIncome>
                                        <ic:nonAllowableDeductionsThisYear>10</ic:nonAllowableDeductionsThisYear>
                                        <ic:nonAllowableDeductionsBroughtForward>10</ic:nonAllowableDeductionsBroughtForward>
                                        <ic:priorYearNonAllowableDeductionsClaimed>10</ic:priorYearNonAllowableDeductionsClaimed>
                                        <ic:nonAllowableDeductionsCarriedForward>10</ic:nonAllowableDeductionsCarriedForward>
                                    </ic:incomeAttribution>
                                </r7:incomeAttributionDetails>
                            </rc:formFields>
                        </rc:fileBody>
                    </r7:fileRequest>
                </fil:FileRequestWrapper>
            </ret:ReturnFileRequestMsg>
        </ret:File>
    </soap:Body>
</soap:Envelope>